Revit 2026 API

# ConnectorElementCoordinateSystem Property

---

The coordinate system of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Transform CoordinateSystem { get; }
```
```vb
Public Overridable ReadOnly Property CoordinateSystem As Transform
	Get
```
```cpp
public:
virtual property Transform^ CoordinateSystem {
	Transform^ get ();
}
```
```fsharp
abstract CoordinateSystem : Transform with get
override CoordinateSystem : Transform with get
```

#### Property Value

Transform

#### Implements

IConnectorCoordinateSystem

The Z axis of the coordinate system is the normal to the plane of the connector.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace